zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_lcd.h
/* ---- LCD 电压控制寄存器 (LCDVCTL) ---- */
/* LCD_LCDVCTL[LCDBIASSEL] - 偏压选择 (1/3 或 1/4) */
#define LCD_LCDVCTL_LCDBIASSEL_OFS               (1)                             /* !< LCDBIASSEL Offset */
#define LCD_LCDVCTL_LCDBIASSEL_MASK              ((uint32_t)0x00000002U)         /* !< Bias select.  LCDBIASSEL is ignored
                                                                                    in static mode as well as for 2-mux,
                                                                                    3-mux and 4-mux LCD modes.  For 5-mux
                                                                                    to 8-mux modes: 0b = 1/3 bias 1b =
                                                                                    1/4 bias */
#define LCD_LCDVCTL_LCDBIASSEL_ONE_BY_3_BIAS     ((uint32_t)0x00000000U)         /* !< 1/3 bias */
#define LCD_LCDVCTL_LCDBIASSEL_ONE_BY_4_BIAS     ((uint32_t)0x00000002U)         /* !< 1/4 bias */
/* LCD_LCDVCTL[LCDCPEN] Bits */
#define LCD_LCDVCTL_LCDCPEN_OFS                  (7)                             /* !< LCDCPEN Offset */
#define LCD_LCDVCTL_LCDCPEN_MASK                 ((uint32_t)0x00000080U)         /* !< Charge pump enable 0b = Charge pump
                                                                                    disabled(1) 1b = Charge pump enabled
                                                                                    when VLCD is generated internally
                                                                                    (VLCDEXT = 0) and VLCDx > 0 or
                                                                                    VLCDREFx > 0. */
#define LCD_LCDVCTL_LCDCPEN_CP_DISABLE           ((uint32_t)0x00000000U)         /* !< Charge pump disabled(1) */
#define LCD_LCDVCTL_LCDCPEN_CP_ENABLE            ((uint32_t)0x00000080U)         /* !< Charge pump enabled when VLCD is
                                                                                    generated internally (VLCDEXT = 0)
                                                                                    and VLCDx > 0 or VLCDREFx > 0. */
/* LCD_LCDVCTL[LCDCPFSELX] Bits */
#define LCD_LCDVCTL_LCDCPFSELX_OFS               (12)                            /* !< LCDCPFSELX Offset */
#define LCD_LCDVCTL_LCDCPFSELX_MASK              ((uint32_t)0x0000F000U)         /* !< Charge pump frequency selection.
                                                                                    0000b = 32.768 kHz / 1 / 8 = 4.096
                                                                                    kHz 0001b = 32.768 kHz / 2 / 8 =
                                                                                    2.048 kHz 0010b = 32.768 kHz / 3 / 8
                                                                                    = 1.365 kHz 0011b = 32.768 kHz / 4 /
                                                                                    8 = 1.024 kHz 0100b = 32.768 kHz / 5
                                                                                    / 8 = 819 Hz 0101b = 32.768 kHz / 6 /
                                                                                    8 = 682 Hz 0110b = 32.768 kHz / 7 / 8
                                                                                    = 585 Hz 0111b = 32.768 kHz / 8 / 8 =
                                                                                    512 Hz 1000b = 32.768 kHz / 9 / 8 =
                                                                                    455 Hz 1001b = 32.768 kHz / 10 / 8 =
                                                                                    409 Hz 1010b = 32.768 kHz / 11 / 8 =
                                                                                    372 Hz 1011b = 32.768 kHz / 12 / 8 =
                                                                                    341 Hz 1100b = 32.768 kHz / 13 / 8 =
                                                                                    315 Hz 1101b = 32.768 kHz / 14 / 8 =
                                                                                    292 Hz 1110b = 32.768 kHz / 15 / 8 =
                                                                                    273 Hz 1111b = 32.768 kHz / 16 / 8 =
                                                                                    256 Hz */
#define LCD_LCDVCTL_LCDCPFSELX_DIV_BY_1_BY_8     ((uint32_t)0x00000000U)         /* !< 32.768 kHz / 1 / 8 = 4.096 kHz */
#define LCD_LCDVCTL_LCDCPFSELX_DIV_BY_2_BY_8     ((uint32_t)0x00001000U)         /* !< 32.768 kHz / 2 / 8 = 2.048 kHz */
#define LCD_LCDVCTL_LCDCPFSELX_DIV_BY_3_BY_8     ((uint32_t)0x00002000U)         /* !< 32.768 kHz / 3 / 8 = 1.365 kHz */
#define LCD_LCDVCTL_LCDCPFSELX_DIV_BY_4_BY_8     ((uint32_t)0x00003000U)         /* !< 32.768 kHz / 4 / 8 = 1.024 kHz */
#define LCD_LCDVCTL_LCDCPFSELX_DIV_BY_5_BY_8     ((uint32_t)0x00004000U)         /* !< 32.768 kHz / 5 / 8 = 819 Hz */
#define LCD_LCDVCTL_LCDCPFSELX_DIV_BY_6_BY_8     ((uint32_t)0x00005000U)         /* !< 32.768 kHz / 6 / 8 = 682 Hz */
#define LCD_LCDVCTL_LCDCPFSELX_DIV_BY_7_BY_8     ((uint32_t)0x00006000U)         /* !< 32.768 kHz / 7 / 8 = 585 Hz */
#define LCD_LCDVCTL_LCDCPFSELX_DIV_BY_8_BY_8     ((uint32_t)0x00007000U)         /* !< 32.768 kHz / 8 / 8 = 512 Hz */
#define LCD_LCDVCTL_LCDCPFSELX_DIV_BY_9_BY_8     ((uint32_t)0x00008000U)         /* !< 32.768 kHz / 9 / 8 = 455 Hz */
#define LCD_LCDVCTL_LCDCPFSELX_DIV_BY_10_BY_8    ((uint32_t)0x00009000U)         /* !< 32.768 kHz / 10 / 8 = 409 Hz */
#define LCD_LCDVCTL_LCDCPFSELX_DIV_BY_11_BY_8    ((uint32_t)0x0000A000U)         /* !< 32.768 kHz / 11 / 8 = 372 Hz */
#define LCD_LCDVCTL_LCDCPFSELX_DIV_BY_12_BY_8    ((uint32_t)0x0000B000U)         /* !< 32.768 kHz / 12 / 8 = 341 Hz */
#define LCD_LCDVCTL_LCDCPFSELX_DIV_BY_13_BY_8    ((uint32_t)0x0000C000U)         /* !< 32.768 kHz / 13 / 8 = 315 Hz */
#define LCD_LCDVCTL_LCDCPFSELX_DIV_BY_14_BY_8    ((uint32_t)0x0000D000U)         /* !< 32.768 kHz / 14 / 8 = 292 Hz */
#define LCD_LCDVCTL_LCDCPFSELX_DIV_BY_15_BY_8    ((uint32_t)0x0000E000U)         /* !< 32.768 kHz / 15 / 8 = 273 Hz */
#define LCD_LCDVCTL_LCDCPFSELX_DIV_BY_16_BY_8    ((uint32_t)0x0000F000U)         /* !< 32.768 kHz / 16 / 8 = 256 Hz */
/* LCD_LCDVCTL[LCDINTBIASEN] Bits */
#define LCD_LCDVCTL_LCDINTBIASEN_OFS             (2)                             /* !< LCDINTBIASEN Offset */
#define LCD_LCDVCTL_LCDINTBIASEN_MASK            ((uint32_t)0x00000004U)         /* !< Enables the internal bias voltage
                                                                                    resistor divider.  The actual voltage
                                                                                    source used for the resistor divider
                                                                                    is selected by the VLCDSEL_VDD_R33
                                                                                    bit configuration.  0b = Internal
                                                                                    bias voltage resistor divider is
                                                                                    disabled 1b = Internal bias voltage
                                                                                    resistor divider is enabledDD */
#define LCD_LCDVCTL_LCDINTBIASEN_INT_BIAS_DISABLE ((uint32_t)0x00000000U)         /* !< Internal bias voltage resistor
                                                                                    divider is disabled */
#define LCD_LCDVCTL_LCDINTBIASEN_INT_BIAS_ENABLE ((uint32_t)0x00000004U)         /* !< Internal bias voltage resistor
                                                                                    divider is enabled */
/* LCD_LCDVCTL[LCDREFEN] Bits */
#define LCD_LCDVCTL_LCDREFEN_OFS                 (6)                             /* !< LCDREFEN Offset */
#define LCD_LCDVCTL_LCDREFEN_MASK                ((uint32_t)0x00000040U)         /* !< Internal reference voltage enable
                                                                                    on R13 0b = Internal reference
                                                                                    voltage disabled 1b = Internal
                                                                                    reference voltage enabled */
#define LCD_LCDVCTL_LCDREFEN_INT_REF_DISABLE     ((uint32_t)0x00000000U)         /* !< Internal reference voltage disabled */
#define LCD_LCDVCTL_LCDREFEN_INT_REF_ENABLE      ((uint32_t)0x00000040U)         /* !< Internal reference voltage enabled */
/* LCD_LCDVCTL[LCDREFMODE] Bits */
#define LCD_LCDVCTL_LCDREFMODE_OFS               (0)                             /* !< LCDREFMODE Offset */
#define LCD_LCDVCTL_LCDREFMODE_MASK              ((uint32_t)0x00000001U)         /* !< Selects whether R13 voltage is
                                                                                    switched or in static mode 0b =
                                                                                    Static mode 1b = Switched mode */
#define LCD_LCDVCTL_LCDREFMODE_STATIC_MODE       ((uint32_t)0x00000000U)         /* !< Static mode */
#define LCD_LCDVCTL_LCDREFMODE_SWITCHED_MODE     ((uint32_t)0x00000001U)         /* !< Switched mode */
/* LCD_LCDVCTL[LCDSELVDD] Bits */
#define LCD_LCDVCTL_LCDSELVDD_OFS                (5)                             /* !< LCDSELVDD Offset */
#define LCD_LCDVCTL_LCDSELVDD_MASK               ((uint32_t)0x00000020U)         /* !< Selects if R33 is supplied either
                                                                                    from AVDD internally or from charge
                                                                                    pump 0b = R33 connected to external
                                                                                    supply 1b = R33 internally connected
                                                                                    to AVDD */
#define LCD_LCDVCTL_LCDSELVDD_SEL_EXT_SUPPLY     ((uint32_t)0x00000000U)         /* !< R33 connected to external supply */
#define LCD_LCDVCTL_LCDSELVDD_SEL_AVDD           ((uint32_t)0x00000020U)         /* !< R33 internally connected to AVDD */
/* LCD_LCDVCTL[LCD_HP_LP] Bits */
#define LCD_LCDVCTL_LCD_HP_LP_OFS                (4)                             /* !< LCD_HP_LP Offset */
#define LCD_LCDVCTL_LCD_HP_LP_MASK               ((uint32_t)0x00000010U)         /* !< High-power or Low-power LCD.  This
                                                                                    bit is only effective when the
                                                                                    internal bias voltage resistor
                                                                                    divider is used, that is, when
                                                                                    LCDINTBIASEN = 1. It selects the
                                                                                    resistor ladder that is used to
                                                                                    generate the bias voltages for the
                                                                                    LCD.  0b = Low-power LCD is used 1b =
                                                                                    Higher-power LCD is used */
#define LCD_LCDVCTL_LCD_HP_LP_LP_MODE            ((uint32_t)0x00000000U)         /* !< Low-power LCD is used */
#define LCD_LCDVCTL_LCD_HP_LP_HP_MODE            ((uint32_t)0x00000010U)         /* !< Higher-power LCD is used */
/* LCD_LCDVCTL[VLCDSEL_VDD_R33] Bits */
#define LCD_LCDVCTL_VLCDSEL_VDD_R33_OFS          (3)                             /* !< VLCDSEL_VDD_R33 Offset */
#define LCD_LCDVCTL_VLCDSEL_VDD_R33_MASK         ((uint32_t)0x00000008U)         /* !< Selects if the LCD bias voltage V1
                                                                                    is sourced from the R33 pin or from
                                                                                    the internal supply voltage AVDD This
                                                                                    bit is only effective when the
                                                                                    internal bias voltage resistor
                                                                                    divider is used, that is, when
                                                                                    LCDINTBIASEN = 1 0b = V1 is sourced
                                                                                    from R33 1b = V1 is sourced
                                                                                    internally from AVDD */
#define LCD_LCDVCTL_VLCDSEL_VDD_R33_SEL_R33      ((uint32_t)0x00000000U)         /* !< V1 is sourced from R33 */
#define LCD_LCDVCTL_VLCDSEL_VDD_R33_SEL_AVDD     ((uint32_t)0x00000008U)         /* !< V1 is sourced internally from AVDD */
/* LCD_LCDVCTL[VLCDX] Bits */
#define LCD_LCDVCTL_VLCDX_OFS                    (8)                             /* !< VLCDX Offset */
#define LCD_LCDVCTL_VLCDX_MASK                   ((uint32_t)0x00000F00U)         /* !< Internal reference voltage select
                                                                                    on R13. */
#define LCD_LCDVCTL_VLCDX_SEL_2P60V              ((uint32_t)0x00000000U)         /* !< 2.60 V */
#define LCD_LCDVCTL_VLCDX_SEL_2P66V              ((uint32_t)0x00000100U)         /* !< 2.66 V */
#define LCD_LCDVCTL_VLCDX_SEL_2P72V              ((uint32_t)0x00000200U)         /* !< 2.72 V */
#define LCD_LCDVCTL_VLCDX_SEL_2P78V              ((uint32_t)0x00000300U)         /* !< 2.78 V */
#define LCD_LCDVCTL_VLCDX_SEL_2P84V              ((uint32_t)0x00000400U)         /* !< 2.84 V */
#define LCD_LCDVCTL_VLCDX_SEL_2P90V              ((uint32_t)0x00000500U)         /* !< 2.90 V */
#define LCD_LCDVCTL_VLCDX_SEL_2P96V              ((uint32_t)0x00000600U)         /* !< 2.96 V */
#define LCD_LCDVCTL_VLCDX_SEL_3P02V              ((uint32_t)0x00000700U)         /* !< 3.02 V */
#define LCD_LCDVCTL_VLCDX_SEL_3P08V              ((uint32_t)0x00000800U)         /* !< 3.08 V */
#define LCD_LCDVCTL_VLCDX_SEL_3P14V              ((uint32_t)0x00000900U)         /* !< 3.14 V */
#define LCD_LCDVCTL_VLCDX_SEL_3P20V              ((uint32_t)0x00000A00U)         /* !< 3.20 V */
#define LCD_LCDVCTL_VLCDX_SEL_3P26V              ((uint32_t)0x00000B00U)         /* !< 3.26 V */
#define LCD_LCDVCTL_VLCDX_SEL_3P32V              ((uint32_t)0x00000C00U)         /* !< 3.32 V */
#define LCD_LCDVCTL_VLCDX_SEL_3P38V              ((uint32_t)0x00000D00U)         /* !< 3.38 V */
#define LCD_LCDVCTL_VLCDX_SEL_3P44V              ((uint32_t)0x00000E00U)         /* !< 3.44 V */
#define LCD_LCDVCTL_VLCDX_SEL_3P50V              ((uint32_t)0x00000F00U)         /* !< 3.50 V */
/* LCD_LCDVCTL[LCDVBSTEN] Bits */
#define LCD_LCDVCTL_LCDVBSTEN_OFS                (24)                            /* !< LCDVBSTEN Offset */
#define LCD_LCDVCTL_LCDVBSTEN_MASK               ((uint32_t)0x01000000U)         /* !< Enables the voltage boost circuitry
                                                                                    which provides a boosted VDDA
                                                                                    voltage. This boosted voltage is to
                                                                                    be used in the switch controls, when
                                                                                    the VDDA supply is less than 1.6V. */
#define LCD_LCDVCTL_LCDVBSTEN_DISABLE            ((uint32_t)0x00000000U)         /* !< Disable. */
#define LCD_LCDVCTL_LCDVBSTEN_ENABLE             ((uint32_t)0x01000000U)         /* !< Enable. */

