zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_lcd.h
/* ---- LCD 端口控制寄存器 0 (LCDPCTL0) ---- */
/* LCD_LCDPCTL0[LCDS0] - LCD 引脚 0 使能 (0=端口功能, 1=LCD 功能) */
#define LCD_LCDPCTL0_LCDS0_OFS                   (0)                             /* !< LCDS0 Offset */
#define LCD_LCDPCTL0_LCDS0_MASK                  ((uint32_t)0x00000001U)         /* !< LCD pin 0 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS0_SEL_PORT              ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS0_SEL_LCD               ((uint32_t)0x00000001U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL0[LCDS1] Bits */
#define LCD_LCDPCTL0_LCDS1_OFS                   (1)                             /* !< LCDS1 Offset */
#define LCD_LCDPCTL0_LCDS1_MASK                  ((uint32_t)0x00000002U)         /* !< LCD pin 1 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS1_SEL_PORT              ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS1_SEL_LCD               ((uint32_t)0x00000002U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL0[LCDS10] Bits */
#define LCD_LCDPCTL0_LCDS10_OFS                  (10)                            /* !< LCDS10 Offset */
#define LCD_LCDPCTL0_LCDS10_MASK                 ((uint32_t)0x00000400U)         /* !< LCD pin 10 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS10_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS10_SEL_LCD              ((uint32_t)0x00000400U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL0[LCDS11] Bits */
#define LCD_LCDPCTL0_LCDS11_OFS                  (11)                            /* !< LCDS11 Offset */
#define LCD_LCDPCTL0_LCDS11_MASK                 ((uint32_t)0x00000800U)         /* !< LCD pin 11 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS11_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS11_SEL_LCD              ((uint32_t)0x00000800U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL0[LCDS12] Bits */
#define LCD_LCDPCTL0_LCDS12_OFS                  (12)                            /* !< LCDS12 Offset */
#define LCD_LCDPCTL0_LCDS12_MASK                 ((uint32_t)0x00001000U)         /* !< LCD pin 12 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS12_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS12_SEL_LCD              ((uint32_t)0x00001000U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL0[LCDS13] Bits */
#define LCD_LCDPCTL0_LCDS13_OFS                  (13)                            /* !< LCDS13 Offset */
#define LCD_LCDPCTL0_LCDS13_MASK                 ((uint32_t)0x00002000U)         /* !< LCD pin 13 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS13_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS13_SEL_LCD              ((uint32_t)0x00002000U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL0[LCDS14] Bits */
#define LCD_LCDPCTL0_LCDS14_OFS                  (14)                            /* !< LCDS14 Offset */
#define LCD_LCDPCTL0_LCDS14_MASK                 ((uint32_t)0x00004000U)         /* !< LCD pin 14 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS14_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS14_SEL_LCD              ((uint32_t)0x00004000U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL0[LCDS15] Bits */
#define LCD_LCDPCTL0_LCDS15_OFS                  (15)                            /* !< LCDS15 Offset */
#define LCD_LCDPCTL0_LCDS15_MASK                 ((uint32_t)0x00008000U)         /* !< LCD pin 15 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS15_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS15_SEL_LCD              ((uint32_t)0x00008000U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL0[LCDS2] Bits */
#define LCD_LCDPCTL0_LCDS2_OFS                   (2)                             /* !< LCDS2 Offset */
#define LCD_LCDPCTL0_LCDS2_MASK                  ((uint32_t)0x00000004U)         /* !< LCD pin 2 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS2_SEL_PORT              ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS2_SEL_LCD               ((uint32_t)0x00000004U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL0[LCDS3] Bits */
#define LCD_LCDPCTL0_LCDS3_OFS                   (3)                             /* !< LCDS3 Offset */
#define LCD_LCDPCTL0_LCDS3_MASK                  ((uint32_t)0x00000008U)         /* !< LCD pin 3 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS3_SEL_PORT              ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS3_SEL_LCD               ((uint32_t)0x00000008U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL0[LCDS4] Bits */
#define LCD_LCDPCTL0_LCDS4_OFS                   (4)                             /* !< LCDS4 Offset */
#define LCD_LCDPCTL0_LCDS4_MASK                  ((uint32_t)0x00000010U)         /* !< LCD pin 4 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS4_SEL_PORT              ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS4_SEL_LCD               ((uint32_t)0x00000010U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL0[LCDS5] Bits */
#define LCD_LCDPCTL0_LCDS5_OFS                   (5)                             /* !< LCDS5 Offset */
#define LCD_LCDPCTL0_LCDS5_MASK                  ((uint32_t)0x00000020U)         /* !< LCD pin 5 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS5_SEL_PORT              ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS5_SEL_LCD               ((uint32_t)0x00000020U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL0[LCDS6] Bits */
#define LCD_LCDPCTL0_LCDS6_OFS                   (6)                             /* !< LCDS6 Offset */
#define LCD_LCDPCTL0_LCDS6_MASK                  ((uint32_t)0x00000040U)         /* !< LCD pin 6 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS6_SEL_PORT              ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS6_SEL_LCD               ((uint32_t)0x00000040U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL0[LCDS7] Bits */
#define LCD_LCDPCTL0_LCDS7_OFS                   (7)                             /* !< LCDS7 Offset */
#define LCD_LCDPCTL0_LCDS7_MASK                  ((uint32_t)0x00000080U)         /* !< LCD pin 7 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS7_SEL_PORT              ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS7_SEL_LCD               ((uint32_t)0x00000080U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL0[LCDS8] Bits */
#define LCD_LCDPCTL0_LCDS8_OFS                   (8)                             /* !< LCDS8 Offset */
#define LCD_LCDPCTL0_LCDS8_MASK                  ((uint32_t)0x00000100U)         /* !< LCD pin 8 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS8_SEL_PORT              ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS8_SEL_LCD               ((uint32_t)0x00000100U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL0[LCDS9] Bits */
#define LCD_LCDPCTL0_LCDS9_OFS                   (9)                             /* !< LCDS9 Offset */
#define LCD_LCDPCTL0_LCDS9_MASK                  ((uint32_t)0x00000200U)         /* !< LCD pin 9 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS9_SEL_PORT              ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL0_LCDS9_SEL_LCD               ((uint32_t)0x00000200U)         /* !< Pins are LCD functions. */

