zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_lcd.h
/* LCD_LCDPCTL3 Bits */
/* LCD_LCDPCTL3[LCDS48] Bits */
#define LCD_LCDPCTL3_LCDS48_OFS                  (0)                             /* !< LCDS48 Offset */
#define LCD_LCDPCTL3_LCDS48_MASK                 ((uint32_t)0x00000001U)         /* !< LCD pin 48 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS48_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS48_SEL_LCD              ((uint32_t)0x00000001U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL3[LCDS49] Bits */
#define LCD_LCDPCTL3_LCDS49_OFS                  (1)                             /* !< LCDS49 Offset */
#define LCD_LCDPCTL3_LCDS49_MASK                 ((uint32_t)0x00000002U)         /* !< LCD pin 49 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS49_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS49_SEL_LCD              ((uint32_t)0x00000002U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL3[LCDS50] Bits */
#define LCD_LCDPCTL3_LCDS50_OFS                  (2)                             /* !< LCDS50 Offset */
#define LCD_LCDPCTL3_LCDS50_MASK                 ((uint32_t)0x00000004U)         /* !< LCD pin 50 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS50_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS50_SEL_LCD              ((uint32_t)0x00000004U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL3[LCDS51] Bits */
#define LCD_LCDPCTL3_LCDS51_OFS                  (3)                             /* !< LCDS51 Offset */
#define LCD_LCDPCTL3_LCDS51_MASK                 ((uint32_t)0x00000008U)         /* !< LCD pin 51 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS51_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS51_SEL_LCD              ((uint32_t)0x00000008U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL3[LCDS52] Bits */
#define LCD_LCDPCTL3_LCDS52_OFS                  (4)                             /* !< LCDS52 Offset */
#define LCD_LCDPCTL3_LCDS52_MASK                 ((uint32_t)0x00000010U)         /* !< LCD pin 52 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS52_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS52_SEL_LCD              ((uint32_t)0x00000010U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL3[LCDS53] Bits */
#define LCD_LCDPCTL3_LCDS53_OFS                  (5)                             /* !< LCDS53 Offset */
#define LCD_LCDPCTL3_LCDS53_MASK                 ((uint32_t)0x00000020U)         /* !< LCD pin 53 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS53_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS53_SEL_LCD              ((uint32_t)0x00000020U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL3[LCDS54] Bits */
#define LCD_LCDPCTL3_LCDS54_OFS                  (6)                             /* !< LCDS54 Offset */
#define LCD_LCDPCTL3_LCDS54_MASK                 ((uint32_t)0x00000040U)         /* !< LCD pin 54 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS54_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS54_SEL_LCD              ((uint32_t)0x00000040U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL3[LCDS55] Bits */
#define LCD_LCDPCTL3_LCDS55_OFS                  (7)                             /* !< LCDS55 Offset */
#define LCD_LCDPCTL3_LCDS55_MASK                 ((uint32_t)0x00000080U)         /* !< LCD pin 55 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS55_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS55_SEL_LCD              ((uint32_t)0x00000080U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL3[LCDS56] Bits */
#define LCD_LCDPCTL3_LCDS56_OFS                  (8)                             /* !< LCDS56 Offset */
#define LCD_LCDPCTL3_LCDS56_MASK                 ((uint32_t)0x00000100U)         /* !< LCD pin 56 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS56_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS56_SEL_LCD              ((uint32_t)0x00000100U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL3[LCDS57] Bits */
#define LCD_LCDPCTL3_LCDS57_OFS                  (9)                             /* !< LCDS57 Offset */
#define LCD_LCDPCTL3_LCDS57_MASK                 ((uint32_t)0x00000200U)         /* !< LCD pin 57 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS57_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS57_SEL_LCD              ((uint32_t)0x00000200U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL3[LCDS58] Bits */
#define LCD_LCDPCTL3_LCDS58_OFS                  (10)                            /* !< LCDS58 Offset */
#define LCD_LCDPCTL3_LCDS58_MASK                 ((uint32_t)0x00000400U)         /* !< LCD pin 58 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS58_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS58_SEL_LCD              ((uint32_t)0x00000400U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL3[LCDS59] Bits */
#define LCD_LCDPCTL3_LCDS59_OFS                  (11)                            /* !< LCDS59 Offset */
#define LCD_LCDPCTL3_LCDS59_MASK                 ((uint32_t)0x00000800U)         /* !< LCD pin 59 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS59_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS59_SEL_LCD              ((uint32_t)0x00000800U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL3[LCDS60] Bits */
#define LCD_LCDPCTL3_LCDS60_OFS                  (12)                            /* !< LCDS60 Offset */
#define LCD_LCDPCTL3_LCDS60_MASK                 ((uint32_t)0x00001000U)         /* !< LCD pin 60 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS60_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS60_SEL_LCD              ((uint32_t)0x00001000U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL3[LCDS61] Bits */
#define LCD_LCDPCTL3_LCDS61_OFS                  (13)                            /* !< LCDS61 Offset */
#define LCD_LCDPCTL3_LCDS61_MASK                 ((uint32_t)0x00002000U)         /* !< LCD pin 61 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS61_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS61_SEL_LCD              ((uint32_t)0x00002000U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL3[LCDS62] Bits */
#define LCD_LCDPCTL3_LCDS62_OFS                  (14)                            /* !< LCDS62 Offset */
#define LCD_LCDPCTL3_LCDS62_MASK                 ((uint32_t)0x00004000U)         /* !< LCD pin 62 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS62_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS62_SEL_LCD              ((uint32_t)0x00004000U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL3[LCDS63] Bits */
#define LCD_LCDPCTL3_LCDS63_OFS                  (15)                            /* !< LCDS63 Offset */
#define LCD_LCDPCTL3_LCDS63_MASK                 ((uint32_t)0x00008000U)         /* !< LCD pin 63 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS63_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL3_LCDS63_SEL_LCD              ((uint32_t)0x00008000U)         /* !< Pins are LCD functions. */

